// Урок 2 - ЕКСПОРТ та ІМПОРТ

// // import '../../script/test'

// // import { message, message2 } from '../../script/test'

// // import MyName from '../../script/test'

// import { Hello } from '../../script/test'

// console.log('container')
// Hello()
// // console.log(MyName)

// ====================================================================
// Урок 3
// Вікно браузера

// Вікно
// Це вбудований об'єкт в JavaScript який є головним об'єктом в
// браузерному середовищі JavaScript, представляючи вікно браузера
// або вкладку, в якому відкрита веб-сторінка та має всередині функціонал браузерного JS

// window

// -------------------------------------------------------------------------
// Горизонтальна позиція
// Це властивість яка повертає горизонтальну позицію (координату Х)
// вікна браузера на екрані монітора

// screenX

// console.log(screenX)

// -------------------------------------------------------------------------
// Вертикальна позиція
// Це властивість яка повертає вертикальну позицію (координату Х)
// вікна браузера на екрані монітора

// screenY

// console.log(screenY)

// -------------------------------------------------------------------------
// Масштаб сторінки
// visualViewport.scale

// -------------------------------------------------------------------------
// Висота та ширина зовнішнього простору вікна
// outerHeight
// outerWidth

// -------------------------------------------------------------------------
// Відображення панелі адреси
// locationbar

// -------------------------------------------------------------------------
// Приховання вбо показ меню браузера
// menubar

// -------------------------------------------------------------------------
// Ім'я вікна браузера
// name

// -------------------------------------------------------------------------
// Відображення панелі закладок
// personalbar

// -------------------------------------------------------------------------
// Видимість скроллбарів
// scrollbars

// -------------------------------------------------------------------------
// Статусний рядок
// statusbar

// -------------------------------------------------------------------------
// Панель інструментів
// toolbar

// -------------------------------------------------------------------------
// Висота та ширина внутрішньої частини вікна
// innerHeight
// innerWidth

// -------------------------------------------------------------------------
// Висота та ширина видимої області
// visualViewport.height
// visulViewport.width

// -------------------------------------------------------------------------
// Горизонтальна та вертикальна прокрутка
// scrollX
// scrollY

// -------------------------------------------------------------------------
// Зсув зліва
// visualViewport.offsetLeft

// -------------------------------------------------------------------------
// Зсув зверху
// visualViewport.offsetTop

// -------------------------------------------------------------------------
// Екран
// screen
